prod-deploy/results/prod-02-2-p1-baseline-20260722/round-2/randwrite-true-B-r1/fio.txt
storage_test: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=551536: Thu Jul 23 01:09:30 2026
  write: IOPS=14.9k, BW=3732MiB/s (3913MB/s)(656GiB/180014msec); 0 zone resets
    slat (usec): min=95, max=51622, avg=7855.63, stdev=7391.79
    clat (usec): min=2, max=15431k, avg=1033344.52, stdev=577686.72
     lat (usec): min=217, max=15431k, avg=1041200.82, stdev=577401.58
    clat percentiles (msec):
     |  1.00th=[  550],  5.00th=[  701], 10.00th=[  802], 20.00th=[  911],
     | 30.00th=[  961], 40.00th=[  995], 50.00th=[ 1028], 60.00th=[ 1053],
     | 70.00th=[ 1083], 80.00th=[ 1116], 90.00th=[ 1167], 95.00th=[ 1200],
     | 99.00th=[ 1284], 99.50th=[ 1435], 99.90th=[12013], 99.95th=[13355],
     | 99.99th=[14832]
   bw (  MiB/s): min= 2017, max= 7024, per=100.00%, avg=4044.41, stdev= 5.07, samples=21057
   iops        : min= 6584, max=38412, avg=16183.29, stdev=28.52, samples=42133
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.11%, 100=0.05%
  lat (msec)   : 250=0.10%, 500=0.43%, 750=6.43%, 1000=34.46%, 2000=57.95%
  lat (msec)   : >=2000=0.45%
  cpu          : usr=0.29%, sys=0.28%, ctx=5435221, majf=2, minf=548212
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,2686995,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3732MiB/s (3913MB/s), 3732MiB/s-3732MiB/s (3913MB/s-3913MB/s), io=656GiB (704GB), run=180014-180014msec